package ua.javarush.task.pro.task03.task0307;

import java.util.Scanner;

/* 
Працювати чи не працювати — отаке питання
Напишемо програму, яка буде зчитувати з клавіатури вік. Якщо вік від 20 до 60 (включно), то виводити нічого не потрібно,
інакше — вивести фразу «можна не працювати». Зробити це можна (і потрібно!) за допомогою лише одного оператора if без else.

Підказка: використовуй логічний оператор "||" (або).


Requirements:
1. Програма повинна зчитувати одне число з клавіатури.
2. Якщо вік не потрапляє в діапазон від 20 до 60, то потрібно вивести фразу "можна не працювати".
3. Якщо вік лежить у діапазоні від 20 до 60 (включно), то виводити нічого не потрібно.
4. У програмі слід використовувати один оператор if без else, а також логічний оператор ||.
*/

public class Solution {
    public static void main(String[] args) {
        //напишіть тут ваш код
        Scanner scanner = new Scanner(System.in);
        int age = scanner.nextInt();
        if (age < 20 || age > 60) {
            System.out.println("можна не працювати");
        }
    }
}
