package ua.javarush.task.pro.task03.task0306;

import java.util.Scanner;

/* 
Трикутник
Напишемо програму, яка буде прораховувати можливість існування трикутника, виходячи з довжин його сторін.
Для цього тобі потрібно:
Ввести з клавіатури три числа — довжини сторін передбачуваного трикутника.
Визначити можливість існування трикутника з даними сторонами.
Результат вивести на екран у такому вигляді: "трикутник існує" або "трикутник не існує".
Щоб це з'ясувати, слід порівняти кожну сторону із сумою двох інших.
Тобто тобі потрібно виконати три порівняння:

Якщо в кожному порівнянні сторона менше суми двох інших, то трикутник із такими сторонами існує.
Якщо принаймні в одному випадку порівняння одна сторона виявиться більшою за суму двох інших або дорівнюватиме їй, то трикутника з такими сторонами не існує.

Requirements:
1. Програма повинна зчитувати три числа з клавіатури.
2. Програма повинна виводити текст на екран згідно з умовою задачі.
3. Якщо трикутник з такими сторонами може існувати, потрібно вивести текст: "трикутник існує".
4. Якщо трикутник із такими сторонами не може існувати, потрібно вивести текст: "трикутник не існує".
*/

public class Solution {
    private static final String TRIANGLE_EXISTS = "трикутник існує";
    private static final String TRIANGLE_NOT_EXISTS = "трикутник не існує";

    public static void main(String[] args) {
        //напишіть тут ваш код
        Scanner scanner = new Scanner(System.in);
        double side1 = scanner.nextDouble();
        double side2 = scanner.nextDouble();
        double side3 = scanner.nextDouble();

        if (side1 < side2 + side3 && side2 < side1 + side3 && side3 < side1 + side2) {
            System.out.println(TRIANGLE_EXISTS);
        } else {
            System.out.println(TRIANGLE_NOT_EXISTS);
        }
    }
}
