package ua.javarush.task.pro.task06.task0602;

/* 
Впорядкована інформація
Тут ти бачиш поганий приклад використання методів:

Методи розділили двовірш;
Один рядок коду не варто обгортати окремим методом.
Перепиши код так, щоб увесь текст виводився в методі main, а решту методів видали.
Результат виведення програми не повинен змінитися.

Requirements:
1. Метод main() має бути єдиним методом у класі Solution.
2. Результат виведення в консоль має відповідати умові задачі.
*/

public class Solution {
    public static void main(String[] args) {
        //напишіть тут ваш код
        System.out.println("Я поет, я звуся Квітик.");
        System.out.println("Вам від мене всім привітик.");
    }
}
