package ua.javarush.task.pro.task04.task0401;

/* 
Я ніколи не працюватиму за дрібняки
Використовуючи цикл while, вивести на екран сто разів цитату (змінна quote):
«Я ніколи не працюватиму за дрібняки. Аміго»

Кожне значення вивести з нового рядка.


Requirements:
1. Програма повинна виводити текст на екран.
2. Програма повинна виводити на екран 100 разів вміст змінної quote.
3. У програмі потрібно використовувати цикл while.
*/

public class Solution {
    public static void main(String[] args) {
        String quote = "Я ніколи не працюватиму за дрібняки. Аміго";
        //напишіть тут ваш код
        int n = 0;
        while (n < 100) {
            ++n;
            System.out.println(quote);
        }
    }
}