package ua.javarush.task.task01.task0142;

/*
Аміго дуже розумний
Напиши програму, яка виводить на екран напис «Аміго дуже розумний».

Requirements:
1. Програма повинна виводити текст.
2. Текст повинен починатися з «Аміго».
3. Текст повинен закінчуватися на «розумний».
4. Текст повинен складатися із 19 символів, включно з пробілами.
5. Виведений текст повинен відповідати завданню.
*/

public class Solution {
    public static void main(String[] args) {
        //напишіть тут ваш код
        System.out.println("Аміго дуже розумний");
    }
}
