/*
Оператор LIKE
У цьому завданні тобі знадобиться:
1. Вибрати всі колонки із таблиці films.
2. Використовуючи оператори WHERE та LIKE, додати умову, що колонка title повинна містити результат підзапиту.
3. У підзапиті слід вибрати колонку title таблиці films, потім додатково вказати, що колонка title повинна містити назву фільму,
який починається з 'The' і закінчується на букву 'r'. 4. Також важливо обмежити результат підзапиту до одного.

Requirements:
1. Запит має бути реалізований згідно з умовою.
*/
-- Write your code here:
SELECT * FROM films WHERE title LIKE (SELECT title FROM films WHERE title LIKE 'The%r' LIMIT 1);