package ua.javarush.task.pro.task07.task0702;

/* 
Максимальне ціле
Створи по одній змінній кожного примітивного цілочислового типу в класі Solution.
Присвой цим змінним максимально можливе для них значення.
Жодного методу створювати не потрібно.


Requirements:
1. У класі Solution мають бути створені змінні всіх примітивних цілочислових типів.
2. Кожній цілочисловій змінній має бути присвоєно максимально можливе для неї значення.
3. У класі Solution не повинно бути створено жодного методу.
*/

public class Solution {
    //напишіть тут ваш код
    byte b = Byte.MAX_VALUE;
    short s = Short.MAX_VALUE;
    int i = Integer.MAX_VALUE;
    long l = Long.MAX_VALUE;
}
