/*
10 везунчиків
У компанії з'явилися зайві гроші, отже вирішили преміювати 10 співробітників, у яких зарплата менша за 500.
Потрібно вибратиз таблиці employee всю інформацію про співробітника та розмір його премії: - 1000,
якщо salary менше або дорівнює 500 - 0, якщо salary більше 500 для тих, у кого значення поля id строго більше 5.
Використовуй оператор IF() і знак <= для розрахунку розміру премії.

Requirements:
1. Запит має бути реалізований згідно з умовою.
*/
-- Write your code here:
SELECT IF(salary <= 500, 0, 1) FROM employee;