package ua.javarush.task.pro.task04.task0416;

import java.util.Scanner;

/* 
Share a Coke
Спробуймо поділити ящик кока-коли на кабінет програмістів. Для цього напишемо програму з такими умовами:

Потрібно ввести з клавіатури два цілих числа. Перше число — кількість банок кока-коли в ящику. Друге — кількість
людей в кабінеті.

Вивести на екран результат ділення першого числа на друге.
Результатом має бути дійсне число.
Приклад уведення:
3
2

Приклад виведення:
1.5


Requirements:
1. Програма повинна зчитувати цілі числа з клавіатури.
2. Програма повинна виводити число на екран.
3. Програма повинна виводити на екран дійсне число — результат ділення першого введеного цілого числа на друге.
*/

public class Solution {
    public static void main(String[] args) {
        //напишіть тут ваш код
        Scanner scanner = new Scanner(System.in);

        // Зчитуємо кількість банок кока-коли в ящику та кількість людей в кабінеті
        int cansInBox = scanner.nextInt();
        int peopleInRoom = scanner.nextInt();

        // Обчислюємо результат ділення та виводимо його на екран
        double cansPerPerson = (double) cansInBox / peopleInRoom;
        System.out.println(cansPerPerson);
    }
}