package ua.javarush.task.pro.task04.task0413;

/* 
Креслимо трикутник
Спробуй вивести на екран прямокутний трикутник із вісімок зі сторонами (катетами) 10 і 10, використовуючи цикл for.
Тобто в першому рядку має бути одна цифра 8 з лівого боку, у другому — дві і т. д.

Приклад виведення на екран:
8
88
888
8888
88888
888888
8888888
88888888
888888888
8888888888


Requirements:
1. Програма повинна виводити числа на екран.
2. Програма повинна виводити прямокутний трикутник із вісімок зі сторонами 10 і 10.
3. У програмі потрібно використовувати цикл for.
4. Виведення на екран повинно відбуватися в циклі for.
*/

public class Solution {
    public static void main(String[] args) {
        //напишіть тут ваш код
        for (int i = 1; i <= 10; i++) {
            for (int j = 1; j <= i ; j++) {
                System.out.print("8");
            }
            System.out.println();
        }
    }
}