package ua.javarush.task.pro.task07.task0703;

/* 
Мінімальне ціле
Створи по одній змінній кожного примітивного цілочислового типу в класі Solution.
Присвой цим змінним мінімально можливе для них значення.
Жодного методу створювати не потрібно.

Requirements:
1. У класі Solution мають бути створені змінні всіх примітивних цілочислових типів.
2. Кожній цілочисловій змінній має бути присвоєно мінімально можливе для неї значення.
3. У класі Solution не повинно бути створено жодного методу.
*/

public class Solution {
    //напишіть тут ваш код
    byte b = Byte.MIN_VALUE;
    short s = Short.MIN_VALUE;
    int i = Integer.MIN_VALUE;
    long l = Long.MIN_VALUE;
}
