package ua.javarush.task.jdk13.task38.task3802;

/* 
Тікети
Реалізуй в окремому файлі анотацію Ticket.

Ось вимоги до неї:
1) Має бути публічною і доступною під час виконання програми.
2) Застосовуватися може лише до нових типів даних (Class, interface (including annotation type), or enum declaration).
3) Повинна містити enum Priority з елементами LOW, MEDIUM, HIGH.
4) Пріоритет буде задавати властивість priority - по дефолту Priority.MEDIUM.
5) Властивість tags буде масивом рядків і буде зберігати теги, що пов'язані з тікетом.
6) Властивість createdBy будет рядком - по дефолту Amigo.

Requirements:
1. Анотація Ticket має бути публічною та доступною під час виконання програми.
2. Анотація Ticket має застосовуватися лише до нових типів даних.
3. Анотація Ticket має містити enum Priority з елементами LOW, MEDIUM, HIGH.
4. Анотація Ticket має містити властивість priority - по дефолту Priority.MEDIUM.
5. Анотація Ticket має містити властивість tags - масив рядків, порожній по дефолту.
6. Анотація Ticket має містити властивість createdBy - рядок, що дорівнює "Amigo" по дефолту.
*/

@Ticket(
        priority = Ticket.Priority.HIGH,
        createdBy = "Noodles",
        tags = {"bug", "fix asap"}
)
public class Solution {
    public static void main(String[] args) {

    }
}

/*

1) Створення анотації Ticket:

Спершу вам потрібно створити новий файл для вашої анотації Ticket. Анотації в Java оголошуються так само, як і інтерфейси,
але використовується символ "@" перед ключовим словом interface.

2)Доступність та застосування:

Щоб зробити анотацію публічною, почніть оголошення з public.
Щоб анотація була доступною під час виконання, використовуйте @Retention(RetentionPolicy.RUNTIME).
Щоб вона могла застосовуватися лише до нових типів даних, використовуйте @Target(ElementType.TYPE).

3) Enum Priority:

Усередині вашої анотації, але перед будь-якими методами, оголосіть enum з іменем Priority і елементами LOW, MEDIUM, HIGH.

4) Властивості анотації:

Додайте властивість priority з типом Priority і значенням за замовчуванням Priority.MEDIUM.
Додайте властивість tags з типом масиву рядків (String[]) і порожнім масивом як значенням за замовчуванням.
Додайте властивість createdBy з типом String і значенням за замовчуванням "Amigo".

*/