package ua.javarush.task.pro.task13.task1330;

public enum MySingleton {
    INSTANCE;

    MySingleton() {
        System.out.println("створення екземпляра...");
    }
}

/*
MySingleton вже є синглтоном через властивості, які надає Java для enum'ів. Однак, коли ми використовуємо статичний блок
ініціалізації

public enum MySingleton {
    INSTANCE;

    static {
        System.out.println("створення екземпляра...");
    }
}

для виведення повідомлення "створення екземпляра...", але це повідомлення не виводиться, оскільки
статичний блок ініціалізації виконується тільки один раз, коли клас завантажується в пам'ять JVM.

Проблема в тому, що якщо ми намагаємося використовувати статичний блок ініціалізації в enum, який не працює так, як ми
очікуємо. Замість цього, ми можемо використовувати конструктор enum для виведення цього повідомлення.

public enum MySingleton {
    INSTANCE;

    MySingleton() {
        System.out.println("створення екземпляра...");
    }
}

Слід зауважити, що конструктор enum є приватним за замовчуванням, тому ми не маємо вказувати модифікатор доступу.
Коли ми звертаємось до MySingleton.INSTANCE вперше, конструктор викликається, і ми побачимо повідомлення
"створення екземпляра...".

*/
