package ua.javarush.task.pro.task02.task0214;

import java.util.Scanner;

/* 
Читання і перетворення рядків

Зчитай з клавіатури три рядки.
А потім зроби таке:

Виведи на екран третій рядок в незміненому вигляді.
Виведи на екран другий рядок, попередньо перетворивши його у верхній регістр.
Виведи на екран перший рядок, попередньо перетворивши його у нижній регістр.
Приклад уведення:

Рядок Номер РАЗ
Другий рядок
Рядок 3
Приклад виведення:

Рядок 3
ДРУГИЙ РЯДОК
рядок номер раз

Requirements:
1. Програма повинна зчитувати з клавіатури три рядки.
2. Третій зчитаний рядок потрібно вивести без змін.
3. Другий зчитаний рядок потрібно вивести у верхньому регістрі.
4. Перший зчитаний рядок потрібно вивести в нижньому регістрі.
5. Усі три рядки потрібно вивести в правильному порядку: третій, другий, перший.
*/

public class Solution {

    public static void main(String[] args) {
        //напишіть тут ваш код
        Scanner scanner = new Scanner(System.in);
        String str1 = scanner.nextLine();
        String str2 = scanner.nextLine();
        String str3 = scanner.nextLine();

        System.out.println(str3);
        System.out.println(str2.toUpperCase());
        System.out.println(str1.toLowerCase());
    }
}
