package ua.javarush.task.pro.task04.task0407;

/* 
Сума чисел, не кратних 3
Вивести на екран суму чисел від1 до 100 включно, які не кратні 3. Використай для цього цикл while.

Підказка: для переходу в циклі до наступного числа використовуй оператор continue.


Requirements:
1. Програма повинна вивести в консоль суму всіх чисел від 1 до 100 включно, які не кратні 3.
2. У програмі потрібно використовувати цикл while.
3. У програмі потрібно використовувати оператор continue.
*/

public class Solution {
    public static void main(String[] args) {
        //напишіть тут ваш код
        int sum = 0;
        int i = 1;

        while (i <= 100) {
            if (i % 3 == 0) {
                i++;
                continue;
            }
            sum += i;
            i++;
        }
        System.out.println(sum);
    }
}