package ua.javarush.task.pro.task11.task1109;

/* 
Об'єкти внутрішніх і вкладених класів
У класі Outer є внутрішній (Inner) клас і вкладений (Nested) клас. Створи в методі main класу Solution
по одному об'єкту кожного з них.


Requirements:
1. У методі main класу Solution потрібно створити об'єкт класу Inner.
2. У методі main класу Solution потрібно створити об'єкт класу Nested.
3. Клас Outer змінювати не можна.
*/

public class Solution {
    public static void main(String[] args) {
        //напишіть тут ваш код

        // Створення об'єкта зовнішнього класу Outer
        Outer outer = new Outer();

        // Створення об'єкта внутрішнього класу Inner за допомогою об'єкта outer
        Outer.Inner inner = outer.new Inner();

        Outer.Nested nested = new Outer.Nested();

    }
}

/*
Внутрішній клас (inner class) є нерозмежованим класом, який знаходиться у тілі зовнішнього класу. Оскільки внутрішній
клас є частином екземпляра зовнішнього класу, він має доступ до полів та методів зовнішнього класу, навіть до приватних.
Внаслідок цього відношення, внутрішній клас не може існувати без екземпляра зовнішнього класу.

Коли ви спробуєте створити об'єкт внутрішнього класу без спочатку створення об'єкту зовнішнього класу, компілятор не
зможе визначити, до якого екземпляра зовнішнього класу має відношення об'єкт внутрішнього класу.

Існує ієрархія між зовнішнім класом та внутрішнім класом, яка вимагає створення об'єкта зовнішнього класу, перш ніж
створити об'єкт внутрішнього класу. Це дає вам можливість використовувати різні екземпляри внутрішнього класу для
різних екземплярів зовнішнього класу, що дозволяє об'єкту внутрішнього класу мати прямий доступ до даних і методів
свого зовнішнього класу.
*/