package ua.javarush.task.jdk13.task06.task0626;

import java.util.Scanner;

/* 
Перша база даних
У класі Solution дано двовимірний масив рядків (поле array), що містить дані про студентів. У кожному рядку перший
елемент – це ідентифікатор студента, другий – його прізвище, третій – ім’я.

Приклад:
123 Іванов Богдан
1425 Петрова Марина
387 Богдан Андрій
98 Богданова Марина

Необхідно реалізувати функціонал пошуку потрібного студента/студентів за будь-яким полем і виведення результату
пошуку на екран у вигляді «ідентифікатор прізвище ім’я» (див. приклад виведення). Тобто, якщо користувач вводить
із клавіатури рядок, потрібно вивести на екран рядок масиву, якщо хоча б один елемент у цьому рядку повністю
збігається з введеним значенням.

Приклади:

Введення:
Богдан
Виведення:
123 Іванов Богдан
387 Богдан Андрій
Введення:
1425
Виведення:
1425 Петров Василь
Введення:
Марина
Виведення:
1425 Петрова Марина
98 Богданова Марина
Зверніть увагу: під час тестування масив буде заповнений іншими даними.


Requirements:
1. У програмі потрібно зчитати рядок із клавіатури.
2. Необхідно реалізувати функціонал пошуку та виведення результату на екран згідно з умовою.
*/

public class Solution {
    public static String[][] array = new String[][]{
            {"123", "Іванов", "Богдан"},
            {"1425", "Петрова", "Марина"},
            {"37", "Богдан", "Андрій"},
            {"98", "Богданова", "Марина"},
            {"6285", "Прутко", "Сергій"},
            {"8", "Клочкова", "Олена"},
            {"754", "Котов", "Іван"}};

    public static void main(String[] args) {
        //напишіть тут ваш код
        Scanner scanner = new Scanner(System.in);
        String s = scanner.nextLine();

        for (int i = 0; i < array.length; i++) {
            for (int j = 0; j < array[i].length; j++) {
                if (s.equals(array[i][j])) {
                    System.out.println(array[i][0] + " " + array[i][1] + " " + array[i][2]);
                    break;
                }
            }
        }
    }
}
