package ua.javarush.task.pro.task03.task0308;

import java.util.Scanner;

/* 
Координатні чверті
Ввести з клавіатури два цілих числа, які будуть координатами точки (перше зчитане число — це координата «x»,
а друге — координата «y»). Відомо, що точка не лежить на координатних осях OX і OY.
Вивести на екран номер координатної чверті, в якій знаходиться ця точка.

Підказка:
Належність точки з координатами (x, y) до однієї із чвертей визначається в такий спосіб:

для першої чверті x>0 і y>0;
для другої чверті x<0 і y>0;
для третьої чверті x<0 і y<0;
для четвертої чверті x>0 і y<0.
Приклад для чисел 4 6:
1
Приклад для чисел -6 -6:
3

Requirements:
1. Програма повинна зчитувати два числа з клавіатури.
2. Програма повинна використовувати команду System.out.println() або System.out.print().
3. Якщо точка знаходиться в першій координатній чверті, вивести "1".
4. Якщо точка знаходиться в другій координатній чверті, вивести "2".
5. Якщо точка знаходиться в третій координатній чверті, вивести "3".
6. Якщо точка знаходиться в четвертій координатній чверті, вивести "4".
*/

public class Solution {
    public static void main(String[] args) {
        //напишіть тут ваш код
        Scanner scanner = new Scanner(System.in);
        int x = scanner.nextInt();
        int y = scanner.nextInt();

        if (x > 0 && y > 0) {
            System.out.println("1");
        } else if (x < 0 && y > 0) {
            System.out.println("2");
        } else if (x < 0 && y < 0) {
            System.out.println("3");
        } else {
            System.out.println("4");
        }
    }
}
