package ua.javarush.task.task01.task0103;

/* 
Мій юний друг
Зараз 3126 рік. Мій друг народився 8 років тому.
Написати програму, яка виводить на екран рік народження мого друга.


Requirements:
1. У програмі має використовуватись виведення на екран.
2. Виведений рік повинен складатися з 4 цифр.
3. Виведений рік повинен починатися з «31».
4. Виведений рік повинен відповідати завданню.
*/

public class Solution {
    public static void main(String[] args) {
        //напишіть тут ваш код
        System.out.println(3126 - 8);
    }
}
