package ua.javarush.task.pro.task03.task0314;

import java.util.Scanner;

/* 
Поламана клавіатура
Аміго створив секретне слово для доступу до закритої інформації, але в нього зламалася клавіатура, і тепер неможливо
набирати літери у верхньому регістрі. Напиши програму, яка порівнюватиме введений рядок з рядком у змінній secret без
урахування регістру.
Якщо введений рядок дорівнює рядку у змінній secret, програма виводить на екран повідомлення «доступ дозволено».
В іншому випадку — «доступ заборонено».


Requirements:
1. Програма повинна зчитувати рядок з клавіатури.
2. У класі Solution має бути публічна статична змінна secret типу String.
3. Якщо введений рядок і рядок у змінній secret однакові, не враховуючи регістр, то програма повинна вивести
повідомлення "доступ дозволено".
4. Якщо введений рядок і рядок у змінній secret різні, не враховуючи регістр, то програма повинна вивести повідомлення
"доступ заборонено".
*/

public class Solution {
    public static String secret = "AmIGo";

    public static void main(String[] args) {
        //напишіть тут ваш код
        Scanner scanner = new Scanner(System.in);
        String word = scanner.nextLine();

        if (secret.equalsIgnoreCase(word)) {
            System.out.println("доступ дозволено");
        } else System.out.println("доступ заборонено");
    }
}
