/*
Досвід залежить від віку?
Замовник вважає, що старші співробітники досвідченіші. Напиши запит, який із таблиці employee на основі року
з дати народження (date_of_birth) вибере в першу колонку "#", якщо рік менше 2000 і "#"; в іншому випадку.
Цю колонку треба назвати досвідчений. До другої колонки потрібно вибрати місяць народження та назвати колонку month_of_birth.
Використовуй IF().

Requirements:
1. Запит має бути реалізований згідно з умовою.
*/
-- Write your code here:
SELECT IF(YEAR(date_of_birth) < 2000, '#', '#') AS 'досвідчений', MONTH(date_of_birth) AS 'month_of_birth' FROM employee;