package ua.javarush.task.task01.task0109;

/* 
«Я за оголошенням…»
Оголоси змінні a, b типу int.
Відразу ж у рядку оголошення присвой їм різні значення.
Значеннями можуть бути будь-які цілі числа.


Requirements:
1. Оголоси дві змінні типу int.
2. Змінні повинні мати імена a і b.
3. Змінним одразу потрібно присвоїти значення.
4. Змінні a і b повинні мати різні значення.«Я за оголошенням…»
Оголоси змінні a, b типу int.
Відразу ж у рядку оголошення присвой їм різні значення.
Значеннями можуть бути будь-які цілі числа.


Requirements:
1. Оголоси дві змінні типу int.
2. Змінні повинні мати імена a і b.
3. Змінним одразу потрібно присвоїти значення.
4. Змінні a і b повинні мати різні значення.
*/

public class Solution {
    public static void main(String[] args) {
        //напишіть тут ваш код
        int a = 1;
        int b = 2;
    }
}
