package ua.javarush.task.pro.task04.task0402;

import java.util.Scanner;

/* 
Усі люблять Мамбу
Ввести з клавіатури ім'я та, використовуючи цикл while, 10 разів вивести: <ім'я> любить мене (змінна text).
Кожного разу виводити текст з нового рядка.
Приклад виведення на екран для імені Ганнуся:
Ганнуся любить мене.
Ганнуся любить мене.
Ганнуся любить мене.
Ганнуся любить мене.
Ганнуся любить мене.
Ганнуся любить мене.
Ганнуся любить мене.
Ганнуся любить мене.
Ганнуся любить мене.
Ганнуся любить мене.


Requirements:
1. Програма повинна зчитувати ім'я з клавіатури.
2. Програма повинна виводити текст на екран.
3. Програма повинна виводити 10 разів текст, указаний у завданні. Кожного разу виводити текст з нового рядка.
4. У програмі потрібно використовувати цикл while.
*/

public class Solution {
    public static void main(String[] args) {
        String text = " любить мене.";
        //напишіть тут ваш код
        Scanner scanner = new Scanner(System.in);
        String name = scanner.nextLine();
        int n = 0;

        while (n < 10) {
            ++n;
            System.out.println(name + text);
        }
    }
}
